Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །བཙུན་པ་སངས་རྒྱས་ཀྱི་ཆོས་ཟབ་མོ་དེ་ལྟ་བུ་ནི་བདག་གིས་གློ་བར་མ་ཆུད་དོ།
en: “Honored One, I had not known that the Buddha’s magical power was so profound.

source: །གལ་ཏེ་བདག་གིས་གློ་བར་ཆུད་པར་གྱུར་ན། བདག་གི་ལུས་ཏིལ་གྱི་ཕྱེ་མ་ལྟར་བགྱིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ལས་མི་ལྡོག་པར་འགྱུར་བ་ཞིག་ན།
en: If I had known, I would never have turned my mind from the goal of complete and supreme awakening, even if my body had broken into pieces like grains of sesame.

source: ད་ནི་ཤིང་ཚིག་པ་བཞིན་ཅི་བགྱིར་ཡང་མ་མཆིས་སོ།
en: Now I am like firewood that has burned out, and I have no more opportunity.”

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ཏེ། ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་ཚེ་དང་ལྡན་པ་གང་པོས་ལས་ཅི་ཞིག་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་པ་ནོར་མང་བ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལགས།
en: All the monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “Honored One, what karma did the venerable Pūrṇa create that matured to cause his birth in a family that was rich and had great wealth and many possessions?

source: ཟས་ཅི་ཞིག་བགྱིས་ན་དེས་བྲན་མོའི་མངལ་དུ་སྐྱེས་ཤིང་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: What karma did he create, because of which he was born from a female slave’s womb, went forth, abandoned all the defilements, and actualized the state of an arhat?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་གང་པོ་ཉིད་ཀྱིས་ལས་ཚོགས་རྙེད་པ། རྐྱེན་ཡོངས་སུ་བསྒྱུར་བ།
en: “Monks,” the Blessed One replied, “the actions were performed and accumulated by the monk Pūrṇa himself, accruing a heap of karma.

source: འོད་པ་བཞིན་དུ་ཉེ་བར་གནས་པ་གདོན་མི་ཟ་བར་འབྱུང་བར་འགྱུར་བ་དག་བྱས་ཤིང་བསགས་པས་གང་པོས་ལས་བྱས་ཤིང་བསགས་པ་དག་གཞན་སུ་ཞིག་གིས་སོ་སོར་མྱོང་བར་འགྱུར།
en: The conditions have ripened, and they approach him like a flood, inevitably. Who else but Pūrṇa would experience the actions that he himself performed and accumulated?

source: དགེ་སློང་དག་ལས་བྱས་ཤིང་བསགས་པ་དག་ནི་ཕྱི་རོལ་གྱི་སའི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར། ཆུའི་ཁམས་ལ་མི་འགྱུར། མེའི་ཁམས་ལ་མི་འགྱུར། རླུང་གི་ཁམས་ལ་མི་འགྱུར་གྱི།
en: Monks, actions performed and accumulated do not mature in the earth element, the water element, the fire element, or the wind element, which are outside the body.

source: འདི་ལྟར་ལས་དགེ་བ་དང་མི་དགེ་བ་བྱས་ཤིང་བསགས་པ་དག་ནི་ཟིན་པའི་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་དག་ལ་རྣམ་པར་སྨིན་པར་འགྱུར་ཏེ།
en: Virtuous and nonvirtuous actions performed and accumulated like this mature in the aggregates, elements, and sense spheres.

source: ལས་རྣམས་བསྐལ་པ་བརྒྱར་ཡང་ནི། །ཆུད་མི་ཟ་བའང་ཚོགས་དང་དུས།
en: “Even after hundreds of eons, Actions are never lost. When the time and conditions are right,

source: །རྙེད་ནས་ལུས་ཅན་རྣམས་ལ་ནི། །འབྲས་བུ་དག་ཏུ་འགྱུར་བ་ཉིད།
en: They bear fruit in embodied beings.

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་སྟོན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Monks, once, in this fortunate eon, when people’s lives were twenty thousand years long, there appeared in the world a teacher named Kāśyapa, who was a tathāgata, an arhat, a perfectly awakened one, perfect in knowledge and conduct, a sugata, world knowing, a supreme tamer of people to be tamed, a teacher of gods and humans, a buddha, and a blessed one.

source: དེ་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱིར་ཉེ་བར་རྟེན་ཅིང་བཞུགས་སོ།
en: He stayed near the city of Vārāṇasī.

source: །དེའི་བསྟན་པ་ལ་འདི་རབ་ཏུ་བྱུང་ནས་སྡེ་སྣོད་གསུམ་པར་གྱུར་ཏེ། ཆོས་བཞིན་གྱིས་དགེ་འདུན་གྱི་ཞལ་ཏ་བ་བྱེད་དོ།
en: “In the teachings of that buddha this Pūrṇa went forth, became well acquainted with the three divisions of the canon, and came to serve as the monk entrusted with the monastery’s business according to the rules.

source: །རེ་ཞིག་ཅིག་ན་དགྲ་བཅོམ་པ་ཞིག་ལ་དགེ་སྐོས་བབ་སྟེ།
en: After a little while, an arhat became responsible for monastic property.

source: དེས་གཙུག་ལག་ཁང་ཕྱག་དར་བྱ་བར་བརྩམས་པ་དང་། རླུང་ལངས་པས་ཕྱག་དར་ཕན་ཚུན་དུ་ཁྱེར་བར་གྱུར་ཏོ།
en: When he started to clean the monastery, a wind arose and blew the dust hither and thither.

source: །དེས་བསམས་པ་རེ་ཞིག་རླུང་ཞི་བར་གྱུར་གྱི་བར་དུ་གཞག་གོ་སྙམ་པ་ལས།
en: The arhat thought, ‘I shall wait for a while until the wind has died down.’

source: ཇི་ཙམ་ན་གཙུག་ལག་ཁང་དེ་མ་ཕྱགས་པ་ཞལ་ཏ་བ་དེས་མཐོང་ནས་དེ་ཀུན་ནས་དཀྲིས་པ་དྲག་པོས།
en: “Then the monk entrusted with the monastery’s business saw that the monastery was unclean;

source: རྩུབ་པོའི་ངག་ཕྱུང་བ།
en: fiercely angry, he spoke harshly:

source: བྲན་མོའི་བུ་གང་ཞིག་དགེ་སྐོས་བྱེད། དགྲ་བཅོམ་པ་དེས་ཐོས་ནས།
en: ‘Which son of a slave woman is responsible for monastic property?’

source: དེས་བསམས་པ། འདི་ཀུན་ནས་དཀྲིས་པ་ཡིན་པས་རེ་ཞིག་བཞག་ལ་ཕྱིས་གོ་བར་བྱའོ་སྙམ་ནས། གང་གི་ཚེ་ཀུན་ནས་དཀྲིས་པ་དང་བྲལ་བ་དེའི་ཚེ། དེའི་དྲུང་དུ་སོང་སྟེ་སྨྲས་པ་ཁྱོད་ཀྱིས་ཁོ་བོ་སུ་ཡིན་ཤེས་སམ།
en: “The arhat thought, ‘Since this person is angry, I shall wait for a while and make him understand later.’ After the monk’s anger subsided, the arhat went to him and asked, ‘Do you know who I am?’

source: དེས་སྨྲས་པ་ཤེས་ཏེ་ཁྱོད་དང་ཁོ་བོ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་བ་ཡིན་ནོ།
en: “ ‘I do,’ said the monk. ‘You and I went forth in the teachings of the Perfectly Awakened One Kāśyapa.’

source: །དེས་སྨྲས་པ་གལ་ཏེ་དེ་ལྟ་ཡིན་མོད་ཀྱི་ཁོ་བོས་ནི་རབ་ཏུ་བྱུང་བའི་བྱ་བ་བྱས་ཏེ།
en: “ ‘That is true,” said the arhat, ‘but I have finished what should be done by a mendicant.

source: ཁོ་བོ་ནི་འཆིང་བ་མཐའ་དག་ལས་གྲོལ་བ་ཡིན་ལ། ཁྱོད་ནི་འཆིང་བ་མཐའ་དག་གིས་བཅིངས་པ་ཡིན་པས་ཁྱོད་ཀྱིས་ངག་རྩུབ་པོའི་ལས་ཕྱུང་གིས་ཉེས་པ་ལ་ཉེས་པར་ཤོགས་ཤིག་དང་། དེས་ན་ལས་དེ་བསྲབས་པ་དང་། ཡོངས་སུ་ཟད་པ་དང་། གཏུགས་པར་འགྱུར་རོ།
en: While I have been released from all bondage, you performed the action of speaking harshly because you remain bound by all bonds. Confess your sin as a sin and hence the action will diminish, waste away, and disappear.’

source: །དེས་ཉེས་པ་ལ་ཉེས་པར་བཤགས་པས་སེམས་ཅན་དམྱལ་བར་སྐྱེ་ཞིང་བྲན་མོའི་བུར་འགྱུར་བ་ལས།
en: “The monk confessed his sin as a sin.

source: དེ་སེམས་ཅན་དམྱལ་བར་མ་སྐྱེས་པས། ཚེ་རབས་ལྔ་བརྒྱར་བྲན་མོའི་མངལ་དུ་སྐྱེས་ཏེ་ད་ལྟར་གྱི་བར་དུ་སྲིད་པ་ཐ་མ་ལ་ཡང་བྲན་མོའི་མངལ་དུ་སྐྱེས་པར་གྱུར་ཏོ།
en: Hence, although he had been doomed to be born in hell and become the son of a female slave, he was not born in hell but was born in a female slave’s womb for five hundred lives. And now, in his last life, he was also born in a female slave’s womb.

source: །གང་ཡང་དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱས་པ་དེས་ན་ཕྱུག་པ་དང་ནོར་མང་བ་དང་། ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་སོ།
en: “And because he had served the community, he was born into a family that was rich and had great wealth and many possessions.

source: །གང་ཡང་དེ་ན་བཀླགས་ཤིང་བཏོན་པས་ཕུང་པོ་ལ་མཁས་པ་དང་། ཁམས་ལ་མཁས་པ་དང་། སྐྱེ་མཆེད་ལ་མཁས་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མཁས་པར་བྱས་པ་དེས་ན་ངའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་མངོན་སུམ་དུ་བྱས་སོ།
en: And because he was well acquainted with the aggregates, elements, sense spheres, and dependent origination through recitation and repetition, he went forth in my teaching, abandoned all the defilements, and actualized the state of an arhat.

source: གཅིག་ཏུ་དཀར་བ་རྣམས་ཀྱི་ནི་གཅིག་ཏུ་དཀར་བ་ཡིན།
en: the maturation of entirely positive actions is entirely positive;

source: འདྲེན་མ་རྣམས་ཀྱི་ནི་འདྲེན་མ་ཡིན་ནོ།
en: the maturation of those that are mixed is mixed.

source: །དགེ་སློང་དག་དེ་ལྟ་བས་ན་ལས་གཅིག་ཏུ་གནག་པ་རྣམས་དང་འདྲེན་མ་ནི་སྤངས་ལ་ལས་གཅིག་ཏུ་དཀར་བ་ལ་བརྩལ་བར་བྱ་སྟེ།
en: Therefore, monks, henceforth you should abandon entirely negative and mixed actions, and you should seek entirely positive actions.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས་དགེ་སློང་དེ་དག་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: Thus spoke the Blessed One, and the monks rejoiced in and praised what the Blessed One had said. VI. Agnidatta A.

source: གླེང་གཞི་ནི་རྒྱལ་པོའི་ཁབ་ནའོ།
en: The Story of the Two Nāga Kings and King Bimbisāra The following took place in Rājagṛha.

source: །དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ན་ཀླུའི་རྒྱལ་པོ་གྲོག་མཁར་དང་རི་བོ་གནས་སོ།
en: At that time, there lived in Rājagṛha two nāga kings named Valguka and Giri.

source: །དེ་གཉིས་ཀྱི་མཐུས་དཀའ་ཐུབ་ཀྱི་ཆུ་ལྔ་བརྒྱ་ཡང་རྟག་ཏུ་འབབ་ལ། ཆུ་མིག་དང་། མཚོ་དང་། མཚེའུ་རྣམས་ཀྱང་སྐམ་པར་མི་འགྱུར། ལྷས་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་ལེགས་པར་ཕབ་པས་ལོ་ཏོག་རྣམས་ཀྱང་ལྷག་པར་ལེགས་པར་འགྱུར་རོ།
en: Because of their power, five hundred hot springs were always flowing, the fountains, lakes, and ponds never dried up, and the gods brought rain at the appropriate times.

source: །གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོ་གཉིས་བཏུལ་བ་ན་དེ་གཉིས་རི་རབ་ཀྱི་བང་རིམ་ནས་ཉི་མ་རེ་རེ་ཞིང་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བྱེད་དུ་འོང་ངོ་།
en: Therefore, the harvest was exceedingly abundant. After the Blessed One had converted the two nāga kings Nanda and Upananda, they both came every day from the terrace of Mount Sumeru to serve the Blessed One.

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་གྲོག་མཁར་དང་རི་བོ་འདི་སྙམ་དུ་སེམས་ཏེ། ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོ་འདི་གཉིས་རི་རབ་ཀྱི་བང་རིམ་ནས་ཉི་མ་རེ་རེ་ཞིང་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བྱེད་ཅིང་འོང་ན། བདག་ཅག་འདི་ཉིད་ན་གནས་བཞིན་དུ་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་མི་བྱེད་པ་ནི་བཟང་པོ་མ་ཡིན་གྱིས།
en: The nāga kings Valguka and Giri thought, “While these nāga kings Nanda and Upananda come every day from the terrace of Mount Sumeru to serve the Blessed One, it is not good that we, living in this very place, do not serve the Blessed One.

source: མ་ལ་བདག་ཅག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བྱའོ་སྙམ་ནས།
en: Therefore, let us serve the Blessed One, too.”

source: དེ་གཉིས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: They went to the Blessed One, and when they had arrived, they bowed low until their foreheads touched the feet of the Blessed One, and then they sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་གཉིས་ལ་དེ་འདྲ་བའི་ཆོས་བཤད་པ་མཛད་དེ།
en: When they had sat down to one side, the Blessed One preached the Dharma that was appropriate for them.

source: དེ་ཐོས་ནས་དེ་གཉིས་སངས་རྒྱས་ལ་སྐྱབས་སུ་དོང་ཞིང་། ཆོས་དང་དགེ་འདུན་ལ་སྐྱབས་སུ་དོང་ནས་བསླབ་པའི་གཞི་རྣམས་བླངས་སོ།
en: After they had heard the Dharma, they sought refuge in the Buddha, Dharma, and Saṅgha and accepted the rules of training.

source: །གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ལས་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བླངས་པ་དེའི་ཚེ། ལུས་དང་ལོངས་སྤྱོད་ལྷག་པར་འཕེལ་བར་གྱུར་ཏོ།
en: Once they had sought refuge in the Blessed One and accepted the rules of training, their bodies and the amount of food they needed for their bodies greatly increased.

source: །དེ་གཉིས་ཀྱིས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ནས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བདག་ཅག་གིས་བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་མཆིས་ཤིང་། བསླབ་པའི་གཞི་རྣམས་མནོས་པ་དེའི་ཚེ་ལུས་དང་ལོངས་སྤྱོད་ལྷག་པར་འཕེལ་བར་གྱུར་ལགས་སོ།
en: They both went to the Blessed One, and when they had arrived, they bowed low until their foreheads touched the feet of the Blessed One, and said, “Blessed One, when we sought refuge in the Blessed One and accepted the rules of training, our bodies and the amount of food we needed for our bodies greatly increased.

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་རྗེས་སུ་གནང་ན་བདག་ཅག་རྒྱ་མཚོ་ཆེན་པོར་འཇུག་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed One, if the Blessed One would authorize it, we will enter the great ocean.”

source: ཀླུའི་དབང་པོ་དག་ཁྱེད་རྒྱལ་པོའི་ཡུལ་ན་གནས་པ་ཡིན་གྱིས་རྒྱལ་པོ་ལ་རྟོགས་ཤིག །དེ་གཉིས་ཀྱིས་བསམས་པ་དང་། དོན་གྱིས་ན་བདག་ཅག་བཅོམ་ལྡན་འདས་ཀྱིས་རྗེས་སུ་མ་གནང་ངོ་ཞེས་སྨྲས་ནས་དེ་ཉིད་ན་གནས་སོ།
en: “Lords of nāgas,” replied the Blessed One, “since you are living in the land of the king, ask the king for permission.” The two considered this and stayed there, saying, “The Blessed One means that he does not give us permission.”

source: །ཀླུའི་རྒྱལ་པོ་གྲོག་མཁར་དང་རི་བོའི་ཀུན་དུ་སྤྱོད་པ་ནི། གལ་ཏེ་ནུབ་མོ་བཅོམ་ལྡན་འདས་ལྟར་འགྲོ་ན་ནི་ལྷའི་བུའི་ཆ་བྱད་ཀྱིས་སོ། །འོན་ཏེ་ཉིན་པར་ན་ནི་ཁྱིམ་བདག་གི་ཆ་བྱད་ཀྱིས་སོ།
en: The nāga kings Valguka and Giri were always dressed as gods if they went to see the Blessed One at night, and as householders if they went by day.

source: །དེ་གཉིས་ཁྱིམ་བདག་གི་ཆ་བྱད་དུ་བྱས་ཤིང་ཉིན་རེ་ཞིང་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བྱེད་དོ།
en: Dressed as householders, they both served the Blessed One every day.

source: །རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་རྒྱལ་རིགས་ཀྱི་མངོན་པའི་ང་རྒྱལ་ཅན་གྱི་ཀུན་དུ་སྤྱོད་པ་ནི་དེ་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ལྟ་བར་འགྲོ་བ་དེའི་ཚེ་འགའ་ཞིག་བདག་མཐོང་ན་ལྡང་བར་མི་བྱེད་པ་མེད་གྲང་ཞེས་མི་གནང་ཆེན་གཏོང་བར་བྱེད་དོ། །དེས་མི་གནང་ཆེན་ཞིག་མངགས་ཏེ།
en: Whenever King Bimbisāra went to see the Blessed One, the king, who was proud of his status as a kṣatriya, always sent his retainer ahead, saying, “There must not be anyone who does not stand up when he sees me.” Once, he sent a retainer, saying, “Hey, go and see who is serving the Blessed One.”

source: ཀྱེ་ནང་རྗེ་སོང་ལ་བཅོམ་ལྡན་འདས་ལ་སུ་དག་བསྙེན་བཀུར་བྱེད་ལྟོས་ཤིག །དེ་སོང་བ་ལས་ཇི་ཙམ་ན་ཁྱིམ་བདག་གཉིས་ཤིག་མཐོང་ནས་དེས་བསམས་པ།
en: The retainer went and saw two householders.

source: འདི་གཉིས་ནི་ལྷའི་ཡུལ་ན་གནས་པས། ཅིའི་ཕྱིར་ལྡང་བར་མི་བྱེད་སྙམ་ནས་དེས་རྒྱལ་པོ་ལ་སྨྲས་པ། ལྷ་ཁྱིམ་བདག་གཉིས་ཤིག་མཆིས་པ་ནི་ལྷའི་ཡུལ་ཉིད་ན་གནས་པ་ལགས་སོ། །རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོས་བསམས་པ།
en: He thought, “Since these two people are living in the land of His Majesty, why would they not stand up at the sight of His Majesty?” He said to the king, “Your Majesty, there are two householders, and they are living in the very land of Your Majesty.”

source: དེ་གཉིས་ཀྱིས་བདག་མཐོང་ན་ཅིའི་ཕྱིར་ལྡང་བར་མི་བྱེད་ཀྱིས་འགྲོའོ་སྙམ་ནས་དེ་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་བ་དང་། ཀླུའི་རྒྱལ་པོ་གྲོག་མཁར་དང་རི་བོས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་མཐོང་ངོ་།
en: King Bimbisāra thought, “Why would those two people not stand up at the sight of me? Therefore, I shall go.” Then he went to the Blessed One.

source: །མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་མཆི་ན་ཅི་རེ་ཞིག་རྒྱལ་པོ་ལ་བསྟི་སྟང་བགྱིའམ། འོན་ཏེ་ཆོས་ལ་བགྱི།
en: When the nāga kings Valguka and Giri saw King Bimbisāra, they asked the Blessed One, “Blessed One, if King Bimbisāra comes, to which should we show respect, the king or the Dharma?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “Nāga kings, show respect to the Dharma,” replied the Blessed One.

source: ཀླུའི་དབང་པོ་དག་ཆོས་ལ་བསྟི་སྟང་བྱོས་ཤིག །དམ་པའི་ཆོས་ལ་ནི་འདི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་བླ་མར་བྱེད་དོ།
en: “Thus the buddhas, the blessed ones, also respected the true Dharma.

source: །ཆོས་ལ་ནི་དགྲ་བཅོམ་པ་རྣམས་ཀྱང་བླ་མར་བྱེད་དོ། །ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: The arhats also respected the Dharma.” He then spoke these verses:

source: འདས་པའི་སངས་རྒྱས་གང་ཡིན་དང་། །མ་བྱོན་སངས་རྒྱས་གང་ཡིན་དང་། །ད་ལྟར་སངས་རྒྱས་གང་ཡིན་པ།
en: “Those who were past buddhas, Those who will be future buddhas, And he who is the present Buddha

source: །མང་པོའི་མྱ་ངན་འཇོམས་མཛད་པ།
en: Conquer many sorrows.

source: །བཞུད་དང་བཞུགས་དང་བྱོན་འགྱུར་བ།
en: “Those who have passed, those who will come, and he who is present

source: །ཐམས་ཅད་དམ་ཆོས་བླ་མར་བྱེད།
en: All respect the true Dharma.

source: །འདི་ནི་སངས་རྒྱས་ཆོས་ཉིད་ཡིན།
en: This is the rule of the buddhas.

source: །དེ་བས་འདིར་བདག་ཕན་འདོད་པ།
en: “Therefore, anyone here who wishes for their own benefit,

source: །བདག་ཉིད་ཆེན་པོར་འདོད་པ་ཡིས།
en: Who wishes for a great state for themselves,

source: །སངས་རྒྱས་བསྟན་པ་དྲན་བྱས་ཏེ།
en: Should remember the teachings of the Buddha

source: །དམ་པའི་ཆོས་ལ་བཀུར་སྟི་བྱ།
en: And show respect to the true Dharma.”

source: །དེ་གཉིས་ཀྱིས་ལྡང་བ་མ་བྱས་སོ། །དེ་ནས་རྒྱལ་པོ་མི་བཟོད་པ་སྐྱེས་ཏེ།
en: The two did not stand up, and the king found this unbearable.

source: དེས་གསོལ་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་བཤད་དུ་གསོལ།
en: He requested, “May the Blessed One preach the Dharma.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: The Blessed One spoke these verses:

source: ཞེ་སྡང་དང་ནི་འཁྲུག་པ་དང་། །མ་དད་པ་ཡི་སེམས་ཀྱིས་ནི།
en: “With thoughts of anger, confusion,

source: །རྫོགས་སངས་རྒྱས་ཀྱིས་བཤད་པ་ཡི། །དམ་ཆོས་ཤེས་པར་མི་ནུས་སོ།
en: And impiety You cannot understand the true Dharma Preached by the Perfectly Awakened One. “One who has controlled his thoughts

source: །གང་གིས་ཁྲོ་དང་བག་མེད་པའི།
en: Of wrath and carelessness,

source: །སེམས་ནི་དུལ་བར་བྱས་པ་དང་། །འདི་ལ་མནར་སེམས་སྤངས་པ་དེས།
en: And abandoned thoughts of torment here,

source: །ལེགས་པར་གསུངས་པ་ཤེས་པར་ནུས།
en: Can understand what is well preached.”

source: །རྒྱལ་པོས་བསམས་པ། ཁྱིམ་བདག་འདི་གཉིས་འོངས་པས་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་གི་ཆོས་ཉན་པའི་བར་ཡང་ཆད་པར་གྱུར་ཏོ་སྙམ་ནས། དེ་སྟན་ལས་ལངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་སོང་ངོ་།
en: The king thought, “Because these two householders came, the Blessed One interrupted my hearing of the Dharma.” He rose from his seat, bowed low until his forehead touched the Blessed One’s feet, and departed.

source: །དེ་སོང་ནས་བློན་པོ་རྣམས་ལ་བསྒོ་བ། ཁྱིམ་བདག་འདི་གཉིས་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་དོང་བ་དེའི་ཚེ།
en: When he had departed, he instructed his ministers, “Sirs, when those two householders depart from the presence of the Blessed One, order them both to leave my land.”

source: ཁྱེད་གཉིས་ངའི་ཡུལ་ན་མ་འདུག་ཤིག་ཅེས་བསྒོས་ཤིག །དེ་གཉིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་སོང་བ་དང་། བློན་པོ་དག་གིས་བསྒོ་བ། ལྷའི་ཞལ་ནས་ཁྱེད་ཅག་གཉིས་ངའི་ཡུལ་ན་མ་འདུག་ཤིག་ཅེས་གསུང་ངོ་།
en: When they had both bowed low until their foreheads touched the Blessed One’s two feet and departed, the ministers ordered them, “This was uttered from His Majesty’s lips: ‘You two must not live in my land.’ ”

source: །དེ་གཉིས་ཀྱིས་སྨྲས་པ། བཀའ་བཞིན་འཚལ་མཆིའོ།
en: “Certainly,” they both answered.

source: །བསམས་པ་བདག་ཅག་གཉིས་ཀྱིས་ཡུན་རིང་པོ་ཞིག་ནས་བསམས་པ་གང་ཡིན་པ་དེ་ནི་ཚེགས་ཆུང་ངུས་གྲུབ་བོ་སྙམ་མོ།
en: The nāga kings then thought, “We both obtained without difficulty the very thing for which we had long hoped.” They then caused a great flood and entered a small valley.

source: །དེ་ནས་འོད་པའི་ཆུ་ཆེན་པོ་ཕྱུང་ནས་གྲོག་པོ་ཆུང་ངུའི་ནང་དུ་ཞུགས་སོ། །གྲོག་པོ་ཆུང་ངུ་ནས་གྲོག་པོ་ཆེན་པོར་རོ། །གྲོག་པོ་ཆེན་པོ་ནས་ཆུ་བྲན་དུའོ། །ཆུ་བྲན་ནས་ཆུ་ཆེན་པོར་རོ། །ཆུ་ཆེན་པོ་ནས་རྒྱ་མཚོ་ཆེན་པོར་ཏེ།
en: Then from the small valley they entered a large valley, from the large valley a small river, from the small river a large river, and from the large river the great ocean.

source: གང་གི་ཚེ་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་པ་དེའི་ཚེ་དེ་གཉིས་ཕྱིར་ཞིང་ལུས་དང་ལོངས་སྤྱོད་ཤིན་ཏུ་འཕེལ་བར་གྱུར་ཏོ།
en: When they entered the great ocean, their bodies and the amount of food they needed for their bodies again greatly increased.

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་རྒྱལ་པོའི་ཁབ་ཀྱི་དཀའ་ཐུབ་ཀྱི་ཆུ་ལྔ་བརྒྱ་དང་། ཆུ་མིག་དང་མཚོ་དང་། མཚེའུ་རྣམས་ཀྱང་ཆུང་བ་དང་། ཡོངས་སུ་ཟད་པ་དང་། གཏུགས་པར་གྱུར་ལ་ཐུག །ལྷས་ཀྱང་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་ལེགས་པར་མ་ཕབ་པས་ལོ་ཉེས་པར་གྱུར་ཏེ།
en: Later, the five hundred hot springs and the fountains, lakes, and ponds in Rājagṛha became smaller, depleted, and dried up, and the gods did not bring rain at the appropriate times.

source: མུ་གེ་ཉམ་ང་བ་དགོན་པའི་སློང་མོ་པས་ཟས་རྙེད་པར་དཀའ་བ་བྱུང་བར་གྱུར་ཏོ།
en: Therefore, there was a very poor harvest, a famine, and fear, and it was difficult for beggars in the wilderness to find food.

source: །རྒྱལ་པོས་བསམས་པ། རྒྱལ་པོའི་ཁབ་འདི་ན་ཀླུའི་རྒྱལ་པོ་རི་བོ་དང་། གྲོག་མཁར་གནས་ཏེ།
en: The king thought, “In this Rājagṛha there once lived the nāga kings Giri and Valguka.

source: དེ་གཉིས་ཀྱི་མཐུས་དཀའ་ཐུབ་ཀྱི་ཆུ་ལྔ་བརྒྱ་ཡང་འབབ། ཆུ་མིག་དང་། མཚོ་དང་། མཚེའུ་རྣམས་ཀྱང་ཆུ་ཆེ། ལྷས་ཀྱང་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་ལེགས་པར་ཕབ་པ་ཉིད་ཀྱིས་ལོ་ཏོག་ལེགས་པར་གྱུར་ན།
en: Thanks to their power, five hundred hot springs were always flowing, the fountains, lakes, and ponds never dried up, the gods brought rain at the appropriate times, and therefore the harvest was abundant.

source: ད་ནི་དཀའ་ཐུབ་ཀྱི་ཆུ་ལྔ་བརྒྱ་དང་། ཆུ་མིག་དང་མཚོ་དང་། མཚེའུ་རྣམས་ཀྱང་ཆུང་བ་དང་། ཡོངས་སུ་ཟད་པ་དང་། གཏུགས་པར་གྱུར་ལ་ཐུག ། ལྷས་ཀྱང་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་ལེགས་པར་མ་ཕབ་པས་ལོ་ཉེས་པར་གྱུར་ཏེ།
en: But now the five hundred hot springs, fountains, lakes, and ponds have become smaller, depleted, and dried up, and the gods have not brought rain at the appropriate times.

source: མུ་གེ་ཉམ་ང་བ་དགོན་པའི་སློང་མོ་པས་ཟས་རྙེད་པར་དཀའ་བ་བྱུང་བར་གྱུར་ན།
en: Therefore, there has been a very poor harvest, a famine, and fear, and it is difficult for beggars in the wilderness to find food.

source: ཀླུའི་རྒྱལ་པོ་རི་བོ་དང་། གྲོག་མཁར་ཤིའམ།
en: Did the nāga kings Giri and Valguka die?

source: བྱའི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་གིས་ཁྱེར་བའམ།
en: Were they taken away by the king of birds, the garuḍa?

source: སྦྲུལ་ཁས་སྡིགས་ཀྱིས་བཟུང་བའམ།
en: Were they captured by a snake charmer?

source: དེས་འཇིགས་ནས་བྲོས་པར་མ་གྱུར་གྲང་།
en: Perhaps they have run away frightened.

source: དེ་ལྟ་མོད་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཐམས་ཅད་གཟིགས་པ་ཡིན་གྱིས། མ་ལ་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་ཞུའོ་སྙམ་དུ་བསམས་ནས།
en: Still, since the Buddha, the Blessed One, is omniscient, one who sees everything, I shall now ask the Blessed One this question.”

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: He went to the Blessed One, and when he arrived, he bowed low until his forehead touched the Blessed One’s feet, and then he sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོས་བཅོམ་ལྡན་འདས་ལ་དོན་དེ་རྒྱས་པར་གསོལ་ཏོ།
en: When he had sat down to one side, King Bimbisāra explained the matter in detail to the Blessed One.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དེ་གཉིས་ནི་ཤི་བ་ཡང་མ་ཡིན། བྱའི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་གིས་ཀྱང་མ་ཁྱེར། སྦྲུལ་ཁས་སྡིགས་ཀྱིས་ཀྱང་མ་བཟུང་།
en: “Great King,” said the Blessed One, “neither has died, nor have they been taken away by the king of birds, the garuḍa, nor been captured by a snake charmer, and they have not run away frightened.

source: དེས་འཇིགས་པས་ཀྱང་མ་བྲོས་མོད་ཀྱི་རྒྱལ་པོ་ཁྱོད་ཉིད་ཀྱིས་ཡུལ་ནས་བསྐྲད་དོ།
en: But you yourself, who are the king, banished them from your land.”

source: །བཅོམ་ལྡན་འདས་བདག་གིས་དེ་གཉིས་མཐོང་བར་ཡང་མི་དྲན་ན་དེ་གཉིས་ཡུལ་ནས་བསྐྲད་པ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: “Blessed One, I have never seen either of them, let alone banished them from my land.”

source: རྒྱལ་པོ་ཆེན་པོ་ངས་ཁྱོད་དྲན་པར་བྱའོ།
en: “Great King, I will remind you.

source: །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་ཁྱིམ་བདག་གཉིས་ཤིག་ཡུལ་ནས་བསྐྲད་པ་དྲན་ནམ།
en: Great King, do you remember banishing two householders from your land?”

source: བཅོམ་ལྡན་འདས་དྲན་ལགས་སོ།
en: “Blessed One, I remember that.”

source: །དེ་གཉིས་ནི་ཀླུའི་རྒྱལ་པོ་རི་བོ་དང་། གྲོག་མཁར་ཡིན་ནོ།
en: “Those two people were the nāga kings Giri and Valguka.”

source: །བཙུན་པ་དེ་གཉིས་གང་དུ་མཆི།
en: “Honored One, where are they now?”

source: རྒྱ་མཚོ་ཆེན་པོར་དོང་ངོ་།
en: “They have gone to the great ocean.”

source: །བདག་གི་ཡུལ་མ་རུང་བར་གྱུར་ལགས་སོ།
en: “My land will be ruined!”

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་གཉིས་ལ་བཟོད་པ་བྱིན་ཅིག་དང་མ་རུང་བར་མི་འགྱུར་རོ།
en: “Great King, beg the two of them for forgiveness, and your land will not be ruined.”

source: །དེ་གཉིས་རྒྱ་མཚོ་ཆེན་པོ་ན་མཆིས་ན་ཇི་ལྟར་བཟོད་པ་སྩལ།
en: “How should I beg them for forgiveness when they are in the great ocean?”

source: དེ་གཉིས་ཚེས་བརྒྱད་དང་བཅུ་བཞི་ལ་ཁྱིམ་བདག་གི་ཆ་བྱད་དུ་བྱས་ནས།
en: “On the eighth and fourteenth days of the month, they both come dressed as householders to bow low until their foreheads touch my feet. At that time, I will make a sign.

source: ངའི་ཞབས་ལ་ཕྱག་འཚལ་དུ་འོངས་པ་དང་ངས་རྟགས་བསྟན་གྱིས་ཁྱོད་ཀྱིས་བཟོད་པ་བྱིན་ཅིག །བཅོམ་ལྡན་འདས་ཅི་བདག་གིས་རྐང་པ་གཉིས་ལ་གཏུག་པར་བགྱིའམ།
en: Then you should beg them for forgiveness.”

source: རྐང་པ་གཉིས་ལ་གཏུག་པར་མི་བྱ་སྟེ།
en: “Blessed One, should I throw myself at their feet, or should I not throw myself at their feet?”
